<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"e0bf1c9a9e5f1cbed31cac5481f7e249f05b0c6980c83250c7159643872e3e63","plan_job_ref":"Job Terraform Plan #10 at https://github.com/getsentry/security-cloud-functions-template/actions/runs/10623050484","plan_hash":"2e056dde4ab49a060e1602b4239ce3c56653b46bd1aa7014f991b9d7e586b710","plan_text_format":"text","version":"1.36.2"} -->
Terraform plan in __.__
<details>
<summary>Plan: 3 to add, 3 to change, 3 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.functions.module.cloud_function["example-gen1"].google_cloudfunctions_function.function will be updated in-place
  ~ resource "google_cloudfunctions_function" "function" {
        id                            = "projects/jeffreyhung-test/locations/us-west1/functions/example-gen1"
        name                          = "example-gen1"
      ~ source_archive_object         = "src-914541cbf9e8a4a5d634c13f83181f0b.zip" -> "src-18c466ec5779266c94567c27199067dc.zip"
        # (28 unchanged attributes hidden)
    }

  # module.functions.module.cloud_function["example-gen1"].google_storage_bucket_object.zip must be replaced
-/+ resource "google_storage_bucket_object" "zip" {
      + content             = (sensitive value)
      ~ crc32c              = "PF8otg==" -> (known after apply)
      ~ detect_md5hash      = "kUVBy/nopKXWNME/gxgfCw==" -> "different hash"
      - event_based_hold    = false -> null
      ~ generation          = 1724966207668615 -> (known after apply)
      ~ id                  = "********************************************************************************" -> (known after apply)
      + kms_key_name        = (known after apply)
      ~ md5hash             = "kUVBy/nopKXWNME/gxgfCw==" -> (known after apply)
      ~ media_link          = "https://storage.googleapis.com/download/storage/v1/b/jeffreyhung-test-cloud-function-staging/o/src-914541cbf9e8a4a5d634c13f83181f0b.zip?generation=1724966207668615&alt=media" -> (known after apply)
      - metadata            = {} -> null
      ~ name                = "src-914541cbf9e8a4a5d634c13f83181f0b.zip" -> "src-18c466ec5779266c94567c27199067dc.zip" # forces replacement
      ~ output_name         = "src-914541cbf9e8a4a5d634c13f83181f0b.zip" -> (known after apply)
      ~ self_link           = "https://www.googleapis.com/storage/v1/b/jeffreyhung-test-cloud-function-staging/o/src-914541cbf9e8a4a5d634c13f83181f0b.zip" -> (known after apply)
      ~ storage_class       = "STANDARD" -> (known after apply)
      - temporary_hold      = false -> null
        # (7 unchanged attributes hidden)
    }

  # module.functions.module.cloud_function["example-gen1-cron"].google_cloudfunctions_function.function will be updated in-place
  ~ resource "google_cloudfunctions_function" "function" {
        id                            = "projects/jeffreyhung-test/locations/us-west1/functions/example-gen1-cron"
        name                          = "example-gen1-cron"
      ~ source_archive_object         = "src-914541cbf9e8a4a5d634c13f83181f0b.zip" -> "src-18c466ec5779266c94567c27199067dc.zip"
        # (28 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.module.cloud_function["example-gen1-cron"].google_storage_bucket_object.zip must be replaced
-/+ resource "google_storage_bucket_object" "zip" {
      + content             = (sensitive value)
      ~ crc32c              = "PF8otg==" -> (known after apply)
      ~ detect_md5hash      = "kUVBy/nopKXWNME/gxgfCw==" -> "different hash"
      - event_based_hold    = false -> null
      ~ generation          = 1724966207668615 -> (known after apply)
      ~ id                  = "********************************************************************************" -> (known after apply)
      + kms_key_name        = (known after apply)
      ~ md5hash             = "kUVBy/nopKXWNME/gxgfCw==" -> (known after apply)
      ~ media_link          = "https://storage.googleapis.com/download/storage/v1/b/jeffreyhung-test-cloud-function-staging/o/src-914541cbf9e8a4a5d634c13f83181f0b.zip?generation=1724966207668615&alt=media" -> (known after apply)
      - metadata            = {} -> null
      ~ name                = "src-914541cbf9e8a4a5d634c13f83181f0b.zip" -> "src-18c466ec5779266c94567c27199067dc.zip" # forces replacement
      ~ output_name         = "src-914541cbf9e8a4a5d634c13f83181f0b.zip" -> (known after apply)
      ~ self_link           = "https://www.googleapis.com/storage/v1/b/jeffreyhung-test-cloud-function-staging/o/src-914541cbf9e8a4a5d634c13f83181f0b.zip" -> (known after apply)
      ~ storage_class       = "STANDARD" -> (known after apply)
      - temporary_hold      = false -> null
        # (7 unchanged attributes hidden)
    }

  # module.functions.module.cloud_function_gen2["example-gen2-cron"].google_cloudfunctions2_function.function will be updated in-place
  ~ resource "google_cloudfunctions2_function" "function" {
        id               = "projects/jeffreyhung-test/locations/us-west1/functions/example-gen2-cron"
        name             = "example-gen2-cron"
        # (11 unchanged attributes hidden)

      ~ build_config {
            # (7 unchanged attributes hidden)

          ~ source {
              ~ storage_source {
                  ~ object     = "src-90ebbf1bfdc8d1b0c1deff70132cdc47.zip" -> "src-03bdfabf8c7adb2ef887fe89f69a0dbe.zip"
                    # (2 unchanged attributes hidden)
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # module.functions.module.cloud_function_gen2["example-gen2-cron"].google_storage_bucket_object.zip must be replaced
-/+ resource "google_storage_bucket_object" "zip" {
      + content             = (sensitive value)
      ~ crc32c              = "N2/bfA==" -> (known after apply)
      ~ detect_md5hash      = "kOu/G/3I0bDB3v9wEyzcRw==" -> "different hash"
      - event_based_hold    = false -> null
      ~ generation          = 1724966207508833 -> (known after apply)
      ~ id                  = "********************************************************************************" -> (known after apply)
      + kms_key_name        = (known after apply)
      ~ md5hash             = "kOu/G/3I0bDB3v9wEyzcRw==" -> (known after apply)
      ~ media_link          = "https://storage.googleapis.com/download/storage/v1/b/jeffreyhung-test-cloud-function-staging/o/src-90ebbf1bfdc8d1b0c1deff70132cdc47.zip?generation=1724966207508833&alt=media" -> (known after apply)
      - metadata            = {} -> null
      ~ name                = "src-90ebbf1bfdc8d1b0c1deff70132cdc47.zip" -> "src-03bdfabf8c7adb2ef887fe89f69a0dbe.zip" # forces replacement
      ~ output_name         = "src-90ebbf1bfdc8d1b0c1deff70132cdc47.zip" -> (known after apply)
      ~ self_link           = "https://www.googleapis.com/storage/v1/b/jeffreyhung-test-cloud-function-staging/o/src-90ebbf1bfdc8d1b0c1deff70132cdc47.zip" -> (known after apply)
      ~ storage_class       = "STANDARD" -> (known after apply)
      - temporary_hold      = false -> null
        # (7 unchanged attributes hidden)
    }

Plan: 3 to add, 3 to change, 3 to destroy.
```
</details>

:white_check_mark: Plan applied in [Terraform Apply #6](https://github.com/getsentry/security-cloud-functions-template/actions/runs/10623061990)